noahbean33/firmware_notes/bootloader/startup_stm32f407vgtx_commented.s
/**
  ******************************************************************************
  * @file      startup_stm32f407vgtx.s
  * @author    Auto-generated by STM32CubeIDE
  * @Abstract : Startup script for STM32F407VGTx Device
  * @version   V1.0.0
  * @date      2020-02-14
  ******************************************************************************
  *
  * OVERVIEW FOR BEGINNERS:
  * ========================
  * This file is the very first code that runs when your STM32 microcontroller
  * powers on or resets. Before your C code (main()) can run, several things
  * must be set up at the hardware level. This file does those things:
  *
  *   1. Sets up the stack pointer (where function call data lives in RAM)
  *   2. Copies initialized global variables from Flash (permanent storage)
  *      into RAM (working memory), because RAM loses its contents on power loss
  *   3. Zeroes out uninitialized global variables (the BSS segment)
  *   4. Calls SystemInit() to configure clocks
  *   5. Calls __libc_init_array() to run C++ static constructors
  *   6. Jumps to your main() function
  *
  * It also defines the "vector table" — a lookup table of function pointers
  * that tells the hardware WHERE to jump when an interrupt or exception fires.
  *
  * This file is written in ARM Thumb assembly. You don't need to edit it
  * unless you are doing very low-level customization.
  */

/* ============================================================================
 * ASSEMBLER DIRECTIVES
 * These are instructions TO the assembler (the program that converts this
 * text into machine code), not instructions that run on the chip itself.
 * ============================================================================ */

.syntax unified      /* Use "unified" ARM/Thumb syntax — a modern syntax that
                        lets you write both ARM and Thumb instructions the
                        same way, instead of having two different styles. */

.cpu cortex-m4       /* Tell the assembler we're targeting the ARM Cortex-M4
                        core inside the STM32F407. This enables Cortex-M4
                        specific instructions. */

.fpu softvfp         /* "softvfp" = software floating point ABI with hardware
                        FPU registers. This means: use the hardware FPU unit
                        for calculations, but pass float arguments through
                        integer registers when calling functions.
                        The alternative is "hard" (hardfp) which passes floats
                        directly in FPU registers — slightly faster but
                        requires all libraries to be compiled the same way. */

.thumb               /* Generate Thumb-2 instructions (16/32-bit compact
                        encoding) rather than full 32-bit ARM instructions.
                        Cortex-M4 ONLY runs Thumb mode — it cannot execute
                        classic 32-bit ARM instructions at all. */

/* ============================================================================
 * GLOBAL SYMBOL EXPORTS
 * These lines make these two symbols visible to the linker and other files.
 * Without .global, a symbol is private to this file.
 * ============================================================================ */

.global g_pfnVectors   /* The interrupt vector table (defined later in this
                          file). The linker needs to find it to place it at
                          address 0x00000000 in Flash. */

.global Default_Handler /* A catch-all handler for any interrupt that doesn't
                           have a real implementation written yet. */

/* ============================================================================
 * LINKER SCRIPT SYMBOL REFERENCES
 * The .word directive places a 32-bit address literal into the output binary.
 * These symbols (starting with underscore) are NOT defined here — they are
 * defined in the linker script (.ld file) which knows the exact memory map
 * of this chip. The linker will fill in the actual addresses at link time.
 *
 * Think of this like declaring "extern" variables in C: we're telling the
 * assembler "these addresses exist somewhere, the linker will resolve them."
 * ============================================================================ */

.word _sidata  /* Source address in Flash where the initial values of
                  initialized global variables are stored.
                  ("si" = source of initialized data) */

.word _sdata   /* Start address in RAM where .data section begins.
                  ("s" = start, "data" = initialized globals/statics) */

.word _edata   /* End address in RAM where .data section ends.
                  ("e" = end) */

.word _sbss    /* Start address in RAM of the .bss section.
                  BSS = Block Started by Symbol — this is where uninitialized
                  global and static variables live. C standard says they must
                  start as zero, so we'll zero this region out explicitly. */

.word _ebss    /* End address in RAM of the .bss section. */


/* ============================================================================
 * RESET HANDLER
 * ============================================================================
 *
 * This is the entry point of your entire program. When the chip powers on
 * or is reset, the hardware automatically:
 *   1. Reads address 0x00000000 → loads it into the Stack Pointer (SP)
 *   2. Reads address 0x00000004 → loads it into the Program Counter (PC)
 *
 * Address 0x00000004 in the vector table contains the address of
 * Reset_Handler, so execution jumps here immediately after reset.
 *
 * .section .text.Reset_Handler
 *   Put this code in a special named section so the linker can place it
 *   correctly. The linker script will pull this into the .text region of Flash.
 *
 * .weak Reset_Handler
 *   "Weak" means: if another file defines a symbol with this same name,
 *   use that one instead and discard this one. This lets application code
 *   override the default startup behavior if needed.
 *
 * .type Reset_Handler, %function
 *   Tells the assembler (and debugger) that this symbol is a function,
 *   not just a data label. Important for correct stack unwinding in debuggers.
 */

  .section .text.Reset_Handler
  .weak Reset_Handler
  .type Reset_Handler, %function

Reset_Handler:

