noahbean33/firmware_notes/bootloader/startup_stm32f407vgtx_commented.s
  /* --- Step 1: Initialize the Stack Pointer ---
   *
   * The stack is a region of RAM used to store:
   *   - Return addresses when calling functions
   *   - Local variables
   *   - Saved register values during interrupts
   *
   * On Cortex-M, the stack grows DOWNWARD in memory (from high address to low).
   * _estack is defined in the linker script as the TOP of RAM (highest address).
   * We load this address into SP (Stack Pointer register, also called r13).
   *
   * "ldr r0, =_estack" is a pseudo-instruction. The assembler generates a
   * PC-relative load from a literal pool — it's loading the 32-bit address
   * value of _estack into register r0.
   *
   * "mov sp, r0" copies that value into the actual Stack Pointer register.
   *
   * After this, any function call or interrupt will use this stack correctly.
   */
  ldr   r0, =_estack
  mov   sp, r0


  /* --- Step 2: Copy .data section from Flash to RAM ---
   *
   * WHY IS THIS NECESSARY?
   * Flash memory retains its contents when power is removed, but it's
   * read-only at runtime (you can't write to Flash during normal execution
   * without a special erase/write procedure). RAM is fast and writable,
   * but loses everything on power-off.
   *
   * When you write C code like:
   *     int myGlobal = 42;   // initialized global variable
   *
   * The value 42 must be stored somewhere permanently (Flash), but the
   * variable itself must live in RAM so it can be modified. The linker puts
   * the initial value (42) into a Flash region called .sidata, and reserves
   * a slot in RAM called .data. This startup code copies from .sidata → .data
   * before main() runs, so your globals have their correct initial values.
   *
   * The copy loop below:
   *   r0 = destination start (RAM: _sdata)
   *   r1 = destination end   (RAM: _edata)
   *   r2 = source start      (Flash: _sidata)
   *   r3 = byte offset counter (starts at 0, increments by 4 each iteration)
   *
   * We jump to LoopCopyDataInit first to check whether there's anything
   * to copy at all (handles the edge case of an empty .data section).
   */
  ldr r0, =_sdata    /* Load address of start of .data section in RAM */
  ldr r1, =_edata    /* Load address of end of .data section in RAM */
  ldr r2, =_sidata   /* Load address of initial values stored in Flash */
  movs r3, #0        /* r3 = 0 (byte offset, starts at beginning) */
  b LoopCopyDataInit /* Jump to the loop condition check first */

CopyDataInit:
  /* Loop body: copy one 32-bit word (4 bytes) per iteration */
  ldr r4, [r2, r3]   /* Load 4 bytes from Flash: address = r2 + r3 offset */
  str r4, [r0, r3]   /* Store those 4 bytes to RAM:  address = r0 + r3 offset */
  adds r3, r3, #4    /* Advance offset by 4 bytes (one word) */
                     /* "adds" sets condition flags (N, Z, C, V) — needed by bcc below */

LoopCopyDataInit:
  /* Loop condition: check if we've reached the end of .data */
  adds r4, r0, r3    /* r4 = current destination address (RAM base + offset) */
  cmp r4, r1         /* Compare current address against end-of-.data (_edata) */
  bcc CopyDataInit   /* BCC = Branch if Carry Clear = Branch if r4 < r1
                        i.e., loop back if we haven't reached the end yet.
                        When r4 >= r1, we fall through and the copy is done. */


  /* --- Step 3: Zero-fill the .bss section in RAM ---
   *
   * WHY IS THIS NECESSARY?
   * The C standard guarantees that uninitialized global and static variables
   * start at zero. For example:
   *     int counter;           // uninitialized global — must start as 0
   *     static int flag;       // uninitialized static — must start as 0
   *
   * The linker places these in a section called .bss (historically "Block
   * Started by Symbol"). Nothing is stored in Flash for .bss (there are no
   * initial values to store — they're all zero). We just need to zero out
   * that RAM region ourselves before main() runs.
   *
   * r2 = current address being zeroed (starts at _sbss)
   * r4 = end address (_ebss)
   * r3 = the value 0 (what we're writing)
   *
   * Same pattern as above: jump to condition check first.
   */
  ldr r2, =_sbss     /* Load start address of .bss in RAM */
  ldr r4, =_ebss     /* Load end address of .bss in RAM */
  movs r3, #0        /* r3 = 0 (the value to write everywhere) */
  b LoopFillZerobss  /* Jump to condition check first */

FillZerobss:
  /* Loop body: write one 32-bit zero per iteration */
  str  r3, [r2]      /* Store 0 into current address (r2 points to RAM) */
  adds r2, r2, #4    /* Advance pointer by 4 bytes */

LoopFillZerobss:
  /* Loop condition: have we zeroed everything up to _ebss? */
  cmp r2, r4         /* Compare current pointer against end of .bss */
  bcc FillZerobss    /* Loop back if r2 < r4 (not done yet) */


  /* --- Step 4: Initialize the system clock ---
   *
   * SystemInit() is a function provided by ST's CMSIS/HAL library (in
   * system_stm32f4xx.c). It configures the PLL (Phase-Locked Loop) and
   * clock prescalers to run the chip at its target frequency (up to 168 MHz
   * on the F407). Without this call, the chip runs from the slow internal
   * RC oscillator at 16 MHz with no PLL.
   *
   * "bl" = Branch with Link. It calls the function AND saves the return
   * address in the Link Register (LR / r14), so the function can return
   * here with "bx lr".
   */
  bl  SystemInit


  /* --- Step 5: Run C++ static constructors ---
   *
   * __libc_init_array() is part of the C runtime library (newlib).
   * It iterates over the .init_array section in Flash and calls every
   * function pointer stored there. The compiler places constructors for
   * global C++ objects there, as well as any functions marked with
   * __attribute__((constructor)) in C.
   *
   * If you're writing pure C with no global objects, this effectively does
   * nothing — but it's safe and correct to always call it.
   */
  bl __libc_init_array


  /* --- Step 6: Call main() ---
   *
   * Everything is now set up. Jump to the user's application entry point.
   * "bl main" is technically a function call (saves return address in LR),
   * which is correct — main() could theoretically return, though on a
   * bare-metal embedded system it normally never does.
   */
  bl main


  /* --- Step 7: Trap if main() ever returns ---
   *
   * On an embedded system, main() returning is almost always a bug —
   * there's nowhere sensible to go back to. This infinite loop prevents
   * the program counter from wandering into random memory and executing
   * garbage instructions, which could cause unpredictable hardware behavior.
   *
   * A debugger can detect the chip is stuck here by examining the PC register.
   */
LoopForever:
    b LoopForever     /* "b" = unconditional Branch — jumps back to itself forever */


