noahbean33/firmware_notes/bootloader/startup_stm32f407vgtx_commented.s
  /* Tell the assembler the size of Reset_Handler (used by debuggers for
     stack unwinding and function boundary detection).
     "." means "current address", so this computes: current_addr - Reset_Handler_start */
  .size Reset_Handler, .-Reset_Handler


/* ============================================================================
 * DEFAULT INTERRUPT HANDLER
 * ============================================================================
 *
 * If an interrupt fires but no specific handler function has been written
 * for it, the weak alias mechanism (defined at the bottom of this file)
 * redirects it here. This handler just spins forever in an infinite loop.
 *
 * In practice, if you hit this handler unexpectedly, it means:
 *   - An interrupt was enabled that you forgot to write a handler for
 *   - An interrupt fired due to a hardware misconfiguration or a bug
 *
 * When debugging, you can set a breakpoint here to catch unexpected interrupts.
 * Then examine the stack and LR register to figure out which interrupt fired.
 *
 * "ax" in the .section directive means:
 *   a = allocatable (takes up space in the binary)
 *   x = executable (contains instructions, not just data)
 * %progbits means it contains actual program data (not zero-fill like .bss)
 */
  .section .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b Infinite_Loop    /* Spin here forever. The system is in an unknown state.
                        A watchdog timer (if configured) will eventually reset
                        the chip and give it another chance to run correctly. */
  .size Default_Handler, .-Default_Handler


/* ============================================================================
 * INTERRUPT VECTOR TABLE
 * ============================================================================
 *
 * WHAT IS THE VECTOR TABLE?
 * On ARM Cortex-M, when an interrupt or exception occurs, the hardware
 * automatically looks up a table of function pointers stored at the very
 * beginning of Flash memory (address 0x00000000). Each slot in the table
 * corresponds to a specific exception or interrupt source. The hardware reads
 * the address stored in that slot and jumps to it — this is the "handler".
 *
 * The table MUST be placed at address 0x00000000 (or at a location pointed
 * to by the VTOR register — Vector Table Offset Register — if you move it).
 * The linker script uses the ".isr_vector" section name to ensure this.
 *
 * TABLE LAYOUT:
 * Slot 0:  Initial Stack Pointer value (not a function — it's loaded into SP at reset)
 * Slot 1:  Reset Handler address (where execution begins)
 * Slot 2+: Exception and interrupt handler addresses
 *
 * Each entry is a 32-bit address (.word = 4 bytes).
 * Entries that say "0" are "reserved" by ST — those interrupt numbers don't
 * exist on this chip, so the slot is left empty (null pointer).
 *
 * "a" in .section means allocatable (included in the binary output).
 * %progbits means it contains real data.
 */
  .section .isr_vector,"a",%progbits
  .type g_pfnVectors, %object
  .size g_pfnVectors, .-g_pfnVectors

g_pfnVectors:

  /* ---- ARM Cortex-M Core Exceptions (positions 0–15) ---- */
  /* These are defined by the ARM architecture itself, not ST.
     Every Cortex-M chip has these same first 16 entries. */

  .word _estack                /* [0] Initial stack pointer value.
                                    NOT a handler address — the hardware loads
                                    this directly into SP (r13) on reset.
                                    _estack is the top of RAM. */

  .word Reset_Handler          /* [1] Reset exception — runs on power-on/reset.
                                    This is the entry point defined above. */

  .word NMI_Handler            /* [2] Non-Maskable Interrupt — cannot be
                                    disabled by software. Used for critical
                                    faults like clock failure. */

  .word HardFault_Handler      /* [3] Hard Fault — fires when a fault occurs
                                    that has no more specific handler, or when
                                    a fault occurs inside another fault handler.
                                    Common causes: null pointer dereference,
                                    stack overflow, bad instruction. */

  .word MemManage_Handler      /* [4] Memory Management Fault — MPU (Memory
                                    Protection Unit) access violation. Fires
                                    when code tries to access memory it's not
                                    allowed to (e.g., executing from RAM when
                                    the MPU forbids it). */

  .word BusFault_Handler       /* [5] Bus Fault — error on the AHB/APB bus
                                    during a memory access. Can be caused by
                                    accessing a non-existent peripheral address
                                    or bad DMA configuration. */

  .word UsageFault_Handler     /* [6] Usage Fault — undefined instruction,
                                    illegal unaligned access, invalid state
                                    transition (e.g., trying to switch to
                                    ARM mode from Thumb-only Cortex-M). */

  .word 0                      /* [7] Reserved by ARM spec */
  .word 0                      /* [8] Reserved by ARM spec */
  .word 0                      /* [9] Reserved by ARM spec */
  .word 0                      /* [10] Reserved by ARM spec */

  .word SVC_Handler            /* [11] SVCall (Supervisor Call) — triggered by
                                    the "svc" instruction. Used by RTOS kernels
                                    (like FreeRTOS) to request privileged
                                    operations from unprivileged task code. */

  .word DebugMon_Handler       /* [12] Debug Monitor — fires when a software
                                    breakpoint or watchpoint is hit while the
                                    debug monitor is active (as opposed to
                                    being halted by a hardware debugger). */

  .word 0                      /* [13] Reserved by ARM spec */

  .word PendSV_Handler         /* [14] PendSV (Pendable Service Call) — a
                                    software-triggerable, low-priority interrupt.
                                    FreeRTOS and other RTOSes use this for
                                    context switching between tasks, because it
                                    can be pended (deferred) and will run after
                                    all higher-priority interrupts complete. */

  .word SysTick_Handler        /* [15] SysTick — a simple 24-bit countdown
                                    timer built into the Cortex-M core.
                                    HAL uses this for the HAL_Delay() 1ms tick.
                                    FreeRTOS uses it for the scheduler tick. */


  /* ---- STM32F407-Specific Peripheral Interrupts (positions 16+) ----
   *
   * Everything from here on is specific to the STM32F407 chip design by ST.
   * These are IRQs (Interrupt Requests) from the on-chip peripherals.
   * The number in the comment is the IRQ number (position - 16).
   * In C code you reference these with enum values like USART1_IRQn.
   *
   * In your application code, you define a handler by simply writing a
   * function with the exact same name, e.g.:
   *
   *     void USART1_IRQHandler(void) {
   *         // handle received byte
   *     }
   *
   * Because these are declared .weak below, your version overrides the
   * default (which just spins forever in Default_Handler).
   */

  .word WWDG_IRQHandler        /* IRQ0:  Window Watchdog — a timer that resets
                                    the chip if your firmware "forgets" to pet
                                    it. Window = must be refreshed within a
                                    specific time window, not too early or late. */

  .word PVD_IRQHandler         /* IRQ1:  PVD (Programmable Voltage Detector) —
                                    fires when VDD supply voltage drops below
                                    a programmable threshold. Useful for
                                    detecting a dying battery before it causes
                                    data corruption. */

  .word TAMP_STAMP_IRQHandler  /* IRQ2:  Tamper detection + Timestamp via EXTI.
                                    RTC tamper pins detect physical tampering
                                    with the hardware. */

