noahbean33/firmware_notes/bootloader/startup_stm32f407vgtx_commented.s
  .word RTC_WKUP_IRQHandler    /* IRQ3:  RTC (Real-Time Clock) Wakeup — wakes
                                    the chip from Stop/Standby low-power modes
                                    on a scheduled interval. */

  .word 0                      /* IRQ4:  Reserved (not used on STM32F407) */

  .word RCC_IRQHandler         /* IRQ5:  RCC (Reset and Clock Control) —
                                    clock security system interrupt. Fires if
                                    the external crystal oscillator fails so
                                    software can switch to the internal backup
                                    oscillator. */

  .word EXTI0_IRQHandler       /* IRQ6:  EXTI Line 0 — External Interrupt on
                                    GPIO pin 0 (PA0, PB0, PC0, etc.).
                                    Used to detect button presses, encoder
                                    pulses, or any digital signal edge. */

  .word EXTI1_IRQHandler       /* IRQ7:  EXTI Line 1 — GPIO pin 1 */
  .word EXTI2_IRQHandler       /* IRQ8:  EXTI Line 2 — GPIO pin 2 */
  .word EXTI3_IRQHandler       /* IRQ9:  EXTI Line 3 — GPIO pin 3 */
  .word EXTI4_IRQHandler       /* IRQ10: EXTI Line 4 — GPIO pin 4 */

  .word DMA1_Stream0_IRQHandler /* IRQ11: DMA1 Stream 0.
                                    DMA = Direct Memory Access. The DMA
                                    controller moves data between peripherals
                                    and RAM without involving the CPU, freeing
                                    the CPU to do other work. Each "stream"
                                    is an independent DMA channel.
                                    This fires when the transfer completes,
                                    or when a transfer error occurs. */

  .word DMA1_Stream1_IRQHandler /* IRQ12: DMA1 Stream 1 */
  .word DMA1_Stream2_IRQHandler /* IRQ13: DMA1 Stream 2 */
  .word DMA1_Stream3_IRQHandler /* IRQ14: DMA1 Stream 3 */
  .word DMA1_Stream4_IRQHandler /* IRQ15: DMA1 Stream 4 */
  .word DMA1_Stream5_IRQHandler /* IRQ16: DMA1 Stream 5 */
  .word DMA1_Stream6_IRQHandler /* IRQ17: DMA1 Stream 6 */

  .word ADC_IRQHandler         /* IRQ18: ADC (Analog-to-Digital Converter)
                                    global interrupt. The F407 has 3 ADCs.
                                    Fires on conversion complete, overrun,
                                    or injected channel end. */

  .word CAN1_TX_IRQHandler     /* IRQ19: CAN1 Transmit — CAN (Controller Area
                                    Network) is a robust serial protocol used
                                    in automotive and industrial systems.
                                    This fires when a CAN frame finishes
                                    transmitting (mailbox empty). */

  .word CAN1_RX0_IRQHandler    /* IRQ20: CAN1 Receive FIFO 0 — fires when a
                                    CAN frame is received into FIFO 0. */

  .word CAN1_RX1_IRQHandler    /* IRQ21: CAN1 Receive FIFO 1 */

  .word CAN1_SCE_IRQHandler    /* IRQ22: CAN1 Status Change / Error —
                                    fires on bus-off, error passive, or
                                    last error code changes. */

  .word EXTI9_5_IRQHandler     /* IRQ23: EXTI Lines 5–9 — GPIO pins 5,6,7,8,9
                                    share a single interrupt. Your handler must
                                    check the EXTI_PR register to determine
                                    which specific pin triggered it. */

  .word TIM1_BRK_TIM9_IRQHandler  /* IRQ24: TIM1 Break + TIM9 global.
                                    TIM1 is an "advanced" timer with PWM
                                    features. The Break input shuts down PWM
                                    outputs on a fault condition (e.g., overcurrent).
                                    TIM9 is a general-purpose timer. */

  .word TIM1_UP_TIM10_IRQHandler  /* IRQ25: TIM1 Update (counter overflow/underflow)
                                    + TIM10 global interrupt. */

  .word TIM1_TRG_COM_TIM11_IRQHandler /* IRQ26: TIM1 Trigger & Commutation
                                    (used in 3-phase motor control) + TIM11 global. */

  .word TIM1_CC_IRQHandler     /* IRQ27: TIM1 Capture/Compare — fires when
                                    a timer channel captures an input signal
                                    timestamp or matches an output compare value. */

  .word TIM2_IRQHandler        /* IRQ28: TIM2 global — 32-bit general purpose
                                    timer, useful for precise time measurement. */

  .word TIM3_IRQHandler        /* IRQ29: TIM3 global — 16-bit general purpose timer */
  .word TIM4_IRQHandler        /* IRQ30: TIM4 global — 16-bit general purpose timer */

  .word I2C1_EV_IRQHandler     /* IRQ31: I2C1 Event — I2C is a 2-wire serial
                                    bus (SDA + SCL) used for sensors, EEPROMs,
                                    displays, etc. The Event interrupt fires on
                                    address match, byte received/sent, STOP detected. */

  .word I2C1_ER_IRQHandler     /* IRQ32: I2C1 Error — bus error, arbitration
                                    loss, NACK received, etc. */

  .word I2C2_EV_IRQHandler     /* IRQ33: I2C2 Event */
  .word I2C2_ER_IRQHandler     /* IRQ34: I2C2 Error */

  .word SPI1_IRQHandler        /* IRQ35: SPI1 global — SPI (Serial Peripheral
                                    Interface) is a fast 4-wire bus (MOSI, MISO,
                                    SCK, CS) used for SD cards, displays,
                                    ADCs, sensors, etc. */

  .word SPI2_IRQHandler        /* IRQ36: SPI2 global */

  .word USART1_IRQHandler      /* IRQ37: USART1 — Universal Synchronous/
                                    Asynchronous Receiver-Transmitter. This is
                                    your standard serial/UART. Fires on byte
                                    received, transmit buffer empty, etc.
                                    Commonly used for debug output or talking
                                    to a PC over USB-serial. */

  .word USART2_IRQHandler      /* IRQ38: USART2 global */
  .word USART3_IRQHandler      /* IRQ39: USART3 global */

