noahbean33/firmware_notes/bootloader/startup_stm32f407vgtx_commented.s
  .word EXTI15_10_IRQHandler   /* IRQ40: EXTI Lines 10–15 — GPIO pins 10–15.
                                    Same shared-interrupt situation as EXTI9_5. */

  .word RTC_Alarm_IRQHandler   /* IRQ41: RTC Alarm A or B through EXTI —
                                    Wake up / trigger at a specific date/time. */

  .word OTG_FS_WKUP_IRQHandler /* IRQ42: USB OTG Full-Speed Wakeup — wakes
                                    the chip from low-power mode when USB
                                    activity is detected. */

  .word TIM8_BRK_TIM12_IRQHandler  /* IRQ43: TIM8 Break + TIM12 global */
  .word TIM8_UP_TIM13_IRQHandler   /* IRQ44: TIM8 Update + TIM13 global */
  .word TIM8_TRG_COM_TIM14_IRQHandler /* IRQ45: TIM8 Trigger/Commutation + TIM14 */
  .word TIM8_CC_IRQHandler     /* IRQ46: TIM8 Capture/Compare */
  .word DMA1_Stream7_IRQHandler /* IRQ47: DMA1 Stream 7 */

  .word FSMC_IRQHandler        /* IRQ48: FSMC (Flexible Static Memory
                                    Controller) — used to interface with
                                    external parallel memories like SRAM,
                                    NOR Flash, and LCD controllers. */

  .word SDIO_IRQHandler        /* IRQ49: SDIO — SD card interface interrupt.
                                    Fires on transfer complete, FIFO errors, etc. */

  .word TIM5_IRQHandler        /* IRQ50: TIM5 global — 32-bit general purpose timer */
  .word SPI3_IRQHandler        /* IRQ51: SPI3 global */

  .word UART4_IRQHandler       /* IRQ52: UART4 global — Note: UART (not USART).
                                    UARTs lack the synchronous clock line that
                                    USARTs have. Still async serial. */

  .word UART5_IRQHandler       /* IRQ53: UART5 global */

  .word TIM6_DAC_IRQHandler    /* IRQ54: TIM6 global + DAC underrun error.
                                    TIM6 is often used as the trigger source
                                    for the DAC (Digital-to-Analog Converter).
                                    Underrun = DAC ran out of data to output. */

  .word TIM7_IRQHandler        /* IRQ55: TIM7 global — basic timer, often used
                                    as a timebase for DAC or periodic callbacks */

  .word DMA2_Stream0_IRQHandler /* IRQ56: DMA2 Stream 0 */
  .word DMA2_Stream1_IRQHandler /* IRQ57: DMA2 Stream 1 */
  .word DMA2_Stream2_IRQHandler /* IRQ58: DMA2 Stream 2 */
  .word DMA2_Stream3_IRQHandler /* IRQ59: DMA2 Stream 3 */
  .word DMA2_Stream4_IRQHandler /* IRQ60: DMA2 Stream 4 */

  .word ETH_IRQHandler         /* IRQ61: Ethernet MAC global interrupt —
                                    the STM32F407 has a built-in 10/100 Mbps
                                    Ethernet MAC (Media Access Controller).
                                    Fires on frame received/sent, etc. */

  .word ETH_WKUP_IRQHandler    /* IRQ62: Ethernet Wakeup through EXTI —
                                    wake from low-power mode on network activity */

  .word CAN2_TX_IRQHandler     /* IRQ63: CAN2 Transmit */
  .word CAN2_RX0_IRQHandler    /* IRQ64: CAN2 Receive FIFO 0 */
  .word CAN2_RX1_IRQHandler    /* IRQ65: CAN2 Receive FIFO 1 */
  .word CAN2_SCE_IRQHandler    /* IRQ66: CAN2 Status/Error */

  .word OTG_FS_IRQHandler      /* IRQ67: USB OTG Full-Speed global interrupt —
                                    the STM32F407 has a built-in USB 2.0
                                    Full-Speed (12 Mbps) OTG controller.
                                    OTG = On-The-Go (can be host or device). */

  .word DMA2_Stream5_IRQHandler /* IRQ68: DMA2 Stream 5 */
  .word DMA2_Stream6_IRQHandler /* IRQ69: DMA2 Stream 6 */
  .word DMA2_Stream7_IRQHandler /* IRQ70: DMA2 Stream 7 */

  .word USART6_IRQHandler      /* IRQ71: USART6 global */

  .word I2C3_EV_IRQHandler     /* IRQ72: I2C3 Event */
  .word I2C3_ER_IRQHandler     /* IRQ73: I2C3 Error */

  .word OTG_HS_EP1_OUT_IRQHandler /* IRQ74: USB OTG High-Speed Endpoint 1 OUT —
                                    the F407 also has a USB HS (480 Mbps)
                                    controller (though it typically needs an
                                    external HS PHY chip). This handles data
                                    flowing OUT from host to device on EP1. */

  .word OTG_HS_EP1_IN_IRQHandler  /* IRQ75: USB OTG HS Endpoint 1 IN —
                                    data flowing IN from device to host on EP1. */

  .word OTG_HS_WKUP_IRQHandler /* IRQ76: USB OTG HS Wakeup through EXTI */
  .word OTG_HS_IRQHandler      /* IRQ77: USB OTG HS global interrupt */

  .word DCMI_IRQHandler        /* IRQ78: DCMI (Digital Camera Interface) —
                                    parallel camera interface for connecting
                                    OV7670-style camera modules directly. */

  .word CRYP_IRQHandler        /* IRQ79: Cryptographic processor global —
                                    hardware AES, DES, Triple-DES acceleration. */

  .word HASH_RNG_IRQHandler    /* IRQ80: Hash (SHA-1, MD5) + RNG (Random Number
                                    Generator) global interrupt. The hardware
                                    RNG uses analog noise to generate true
                                    random numbers — useful for cryptography. */

  .word FPU_IRQHandler         /* IRQ81: FPU (Floating-Point Unit) global —
                                    fires on FPU exceptions like divide-by-zero,
                                    overflow, underflow, or invalid operation,
                                    if those exception traps are enabled. */

  /* Slots 82–87: Reserved by ST (these IRQ numbers don't exist on F407) */
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0
  .word 0

  .word LCD_TFT_IRQHandler     /* IRQ88: LTDC (LCD-TFT Display Controller) —
                                    the F407 has a hardware layer compositor
                                    for driving RGB TFT displays. This fires
                                    on frame sync, line events, etc. */

